Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །གཙུག་ལག་ཁང་དང་། དགོན་པའི་གནས་དེར་ཡང་ཁྱིམ་གྱི་གཞི་ནས་ཞིང་གི་གཞི་དང་། བྲན་དང་། བྲན་མོ་དང་། ཀུན་དགའ་ར་བའི་བར་དེ་དག་གི་ལོངས་སྤྱོད་དང་། ཉེ་བར་སྤྱོད་པའི་ཕྱིར་ཡོངས་སུ་གཏོང་བ་བྱེད་པར་འགྱུར་རོ།
en: In those temples and hermitages, they will also give offerings of houses and fields, male and female servants, and monastic compounds for their use and enjoyment.

source: །དེ་དག་འཆི་བའི་དུས་བྱས་ནས་ཀྱང་རྒྱལ་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དག་ཏུ་སྐྱེ་བར་འགྱུར་བ་ནས། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བའི་བར་དུ་འགྱུར་རོ།
en: After they die, they will be born as members of the kṣatriya class who are like great sal trees, or in other states up to the gods of the sphere of neither perception nor nonperception.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དག་ཏུ་ཡང་སྐྱེ་བར་འགྱུར་རོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་ཡང་ཕྲད་པར་འགྱུར་བ་ནས་རིང་པོ་མི་ཐོགས་པར་སྦྱིན་པ་པོ་དང་། སྦྱིན་བདག་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་བར་དུ་འགྱུར་ཏེ།
en: They will also be born within pure buddha realms where they will meet blessed buddhas, and before long those almsgivers and benefactors will awaken to unsurpassed and perfect buddhahood.

source: དེ་དག་ནི་ངའི་བསྟན་པ་ལ་དགེ་སློང་ཆོས་ཀྱིས་གནས་པ་རྣམས་ཡང་དག་པར་འཛིན་པར་བྱེད་པར་འགྱུར་བ་ཡིན་ནོ། །
en: They will support the monks who abide by the Dharma under my teachings.

source: རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟ་སྟེ། གང་ཁྱོད་ཀྱི་བུའམ། སྤུན་ནམ། བཀྲབས་པའམ། སྣ་ཆེན་པོ་ལ་གཏོགས་པ་གང་ཡང་རུང་བ་ཞིག་ཉེས་པ་དང་བཅས་པ་ཡིན་ན།
en: “Your Majesty, imagine that one of your sons, siblings, dignitaries, or senior officials were to engage in wrongdoing.

source: གང་དང་གང་དུ་རྒྱལ་པོ་ཆེན་པོའི་དུས་སྟོན་ནམ་དགའ་སྟོན་བྱུང་བ་དེར་རྒྱལ་པོ་ཆེན་པོས་དགའ་བ་དང་བདེ་བ་རྣམ་པ་སྣ་ཚོགས་ཉམས་སུ་མྱོང་བར་བྱེད་ན། རྒྱལ་པོ་ཆེན་པོ་འདི་ཇི་སྙམ་དུ་སེམས། སྐྱེས་བུ་དེ་ཁྱོད་ཀྱི་མདུན་དུ་འདུག་ཅིང་སྐྱིད་པ་དང་རྩེ་བ་མྱོང་བར་བྱེད་པའམ། དགའ་བ་དང་བདེ་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གནས་པར་བྱེད་ནུས་སམ།
en: Your Majesty, what do you think? While you partake in a variety of joys and pleasures during the celebrations and festivals that you, great king, offer, would that person be able to remain in front of you and feel happy and playful and experience different types of joy and pleasure?”

source: རྒྱལ་པོ་ཆེན་པོས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་མ་ལགས་ཏེ། སྐྱེས་བུ་དེས་བདག་གི་མདུན་ན་མཆིས་པར་ཡང་རྔོ་མི་ཐོགས་ལགས་ན་སྐྱིད་པ་དང་རྩེ་བ་མྱོང་བར་བགྱིད་པ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: “No, respected Blessed One,” replied the king, “that person would dare not come in front of me, so there is no need to speak of him feeling happy and playful!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་དུ་གང་ཟག་གང་ཞིག་གང་ཟག་གིར་བྲན་དང་། བྲན་མོ་སྲེལ་བར་བྱེད་ཅིང་ཁྱིམ་གྱི་གཞི་ནས་ཞིང་གི་གཞི་དང་། ལུག་དག་གི་བར་སྲེལ་བར་བྱེད་ན། ང་ཡང་དེའི་སྟོན་པ་མ་ཡིན་ལ། དེ་ཡང་ངའི་ཉན་ཐོས་མ་ཡིན་ནོ།
en: “Similarly, Your Majesty,” continued the Blessed One, “if someone takes possession of male and female servants, offerings related to houses and fields, and everything else up to sheep, I am not the teacher of that person, and that person is not my hearer.

source: །དུས་གསུམ་དུ་གཤེགས་པའི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ལ་ཡང་གནོད་པར་བྱེད་པ་དང་བཅས་པ་ཡིན་ནོ། །དེ་ནི་ཆོས་ཀྱི་གནས་པ་རྣམས་ཀྱི་གནས་དེ་ལྟར་བསྔོས་པ་དག་ཏུ་ཆོས་དང་འཐུན་པས་གནས་པར་འོས་པ་མ་ཡིན་ནོ།
en: That person harms all the perfect buddhas of the three times and does not deserve to reside, in accordance with the Dharma, in those places that have been dedicated to those who abide by the Dharma.

source: །རྒྱལ་རིགས་དང་། བྲམ་ཟེ་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་གང་ཡང་སྡིག་པ་ཅན་གྱི་དགེ་སློང་ཡོངས་སུ་འཛིན་པ་དང་བཅས་པ་དེའི་དོན་བྱེད་པ་དང་། དེ་ནས་འགྲོར་མི་སྟེར་བའི་རྒྱལ་རིགས་ནས་དམངས་རིགས་ཀྱི་བར་དེ་ནི་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ལ་ཡང་གནོད་པ་བྱེད་པ་དང་བཅས་པ་ཆེན་པོ་ཡིན་ནོ།
en: All the members of the kṣatriya class, the brāhmaṇa class, the vaiśya class, and the śūdra class who benefit those evil and greedy monks and do not make them leave those places also cause great harm to all the blessed buddhas of the three times.

source: །སྦྱིན་པ་མང་པོ་སྦྱིན་པར་བྱེད་དུ་ཟིན་ཀྱང་འོན་ཀྱང་དེ་འཆི་བའི་དུས་བྱས་ནས་མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: Though they may have performed many acts of generosity, after they die they will be born within the great Hell of Unceasing Torment.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན་བདག་ལ་ཕན་པར་ཡང་དག་པར་རྗེས་སུ་ལྟ་བས་སྡིག་པ་ཅན་གྱི་དགེ་སློང་ཡོངས་སུ་འཛིན་པ་དང་བཅས་པའི་ཕྱོགས་སུ་གནས་པར་མི་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Therefore, Your Majesty, since they only consider their own benefit, one should not side with those evil and greedy monks. Why?

source: འདི་ལྟར་དེ་ནི་ལྷ་དང་མི་ཐམས་ཅད་ལ་ཡང་གནོད་པ་དང་། ཕན་པ་མ་ཡིན་པ་དང་། ལོག་པར་ལྟུང་བར་བྱ་བའི་ཕྱིར་ཞུགས་པ་དང་། དཀོན་མཆོག་གསུམ་གྱི་གདུང་མེད་པར་བྱ་བའི་ཕྱིར་ཞུགས་པ་ཡིན་པའི་ཕྱིར་རོ། །
en: Because they harm all the gods and humans; they do not benefit them, they cause them to fall into error, and they destroy the lineage of the Three Jewels.

source: རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་རིགས་སམ། བྲམ་ཟེའམ། རྗེའུ་རིགས་སམ། དམངས་རིགས་གང་ཞིག་དགེ་སློང་ཆོས་ཀྱིས་གནས་པ་རྣམས་ཀྱི་ཆོས་ཀྱི་ཕྱོགས་ལ་ཡང་དག་པར་གནས་པར་བྱེད་ཅིང་། སྡིག་པ་ཅན་གྱི་དགེ་སློང་རྣམས་ཀྱི་ཕྱོགས་ལ་མ་ཡིན་ན། དེ་སྦྱིན་པ་མི་སྦྱིན་དུ་ཟིན་ཀྱང་འོན་ཀྱང་དེ་ནི་ཆོས་ཀྱི་ཕྱོགས་ཀྱི་རྒྱུའི་ཕྱིར་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་སྦྱིན་བདག་དམ་པ་ཡིན་ནོ།
en: “Your Majesty, if members of the kṣatriya class, the brāhmaṇa class, the vaiśya class, and the śūdra class remain on the side of the teaching of the monks who abide by the Dharma, and if they do not side with evil monks, even if they have not performed acts of generosity, since they side with the Dharma they are sublime benefactors of all the blessed buddhas of the three times.

source: །དེ་ནི་དམ་པའི་ཆོས་རྗེས་སུ་བསྲུང་བའི་ཕྱིར་དམ་པའི་ཆོས་འཛིན་པ་དམ་པ་ཡིན་པར་བལྟ་བར་བྱའོ།
en: Since they protect the sacred Dharma, they should be regarded as the sacred upholders of the sacred Dharma.

source: །འཆི་བའི་དུས་བྱས་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་བ་ནས་རིང་པོ་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་བར་དུ་འགྱུར་རོ།
en: After they die they will be born within pure buddha realms, and before long they will awaken to unsurpassed and perfect buddhahood.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན་རྒྱལ་རིགས་འཚམ་པ་ཁྱོད་ཀྱི་ལག་ཏུ་ཆོས་ཀྱིས་གནས་པ་དང་བསྟན་པ་ངས་ཡོངས་སུ་གཏད་ཀྱིས་ལྔ་བརྒྱ་པ་ཐ་མ་ལ་གནས་པའི་བར་དུ་ཁྱེད་ཀྱིས་ངའི་ཆོས་ཀྱིས་གནས་པ་དག་ཡང་དག་པར་ཟུང་ཤིག་དང་། དེའི་རྐྱེན་གྱིས་ངའི་ཆོས་ཀྱི་ཚུལ་འདི་དང་། དཀོན་མཆོག་གསུམ་གྱི་གདུང་ཡུན་རིང་དུ་གནས་པར་འགྱུར་ཞིང་། ལྷ་དང་མི་རྣམས་ལ་ཕན་པ་དང་བདེ་བར་འགྱུར་རོ།
en: Therefore, Your Majesty, wholesome member of the kṣatriya class, I entrust to you and place in your hands the followers of the Dharma and its teachings. Until the last five hundred years, support my Dharma followers! Thereby, my Dharma way and the lineage of the Three Jewels will endure for a long time, and the gods and humans will be benefited and experience happiness.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཞལ་ཏ་པ་ཞེས་བགྱི་ལགས་ན་བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན་ཞལ་ཏ་པར་གདགས་པས་གདགས་པར་མཛད་པ་ལགས།
en: Then King Bimbisāra asked the Blessed One, “Respected Blessed One, what are the criteria for someone to be called an attendant?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དགེ་སློང་གཉིས་ཞལ་ཏ་པར་ངས་གནང་ངོ་།
en: “Your Majesty,” replied the Blessed One, “I have authorized two types of monks to be attendants.

source: །གཉིས་གང་ཡིན་ཞེ་ན།
en: What are those two?

source: གང་ཡང་རྣམ་པར་ཐར་པ་བརྒྱད་ལ་སྒོམ་པའི་དགྲ་བཅོམ་པ་དང་། གང་ཡང་དགེ་སློང་སློབ་པ་རྒྱུན་དུ་ཞུགས་པ་ཡིན་ཏེ།
en: They are worthy ones who cultivate the eight aspects of liberation and monks in training who have entered the stream.

source: རྒྱལ་པོ་ཆེན་པོ་དགེ་སློང་འདི་གཉིས་ཞལ་ཏ་པའི་ལས་བྱེད་པར་ངས་གནང་ངོ་།
en: Your Majesty, I have authorized those two types of monks to perform the function of attendants.”

source: །འདུས་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ་ལས་ལེའུ་བཅུ་གཅིག་པ་སྟེ། ཉི་མའི་སྙིང་པོའི་ལེའུ་ལས་དམ་པའི་ཆོས་བསྲུང་བའི་འདུས་པ་དང་པོ་རྫོགས་སོ།། །།
en: This concludes the chapter called “The Protection of the Sacred Dharma,” the first among the eleven chapters included in “The Quintessence of the Sun,” the Great Vehicle discourse of The Great Assembly.

source: གང་གི་ཚེ་བཅོམ་ལྡན་འདས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་དང་ཐབས་ཅིག་ཏུ་དགེ་སློང་ཆོས་ཀྱིས་གནས་པ་རྣམས་ཀུན་ཏུ་བསྲུང་བའི་གཏམ་ཡང་ཡང་དག་པར་རྩོམ་པ་མཛད་པ་དེའི་ཚེ་དེའི་དུས་ན། ཤར་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་གདུང་བ་མེད་པ་ཞེས་བྱ་བ་ཡོད་དོ། །དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཙམ་པ་ཀའི་མདོག་ཅེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: When the Blessed One had begun this discourse with King Bimbisāra on how to protect all those monks who abide by the Dharma, in the eastern direction, beyond countless buddha realms as numerous as the grains of sand in the Ganges, there was a world called Absence of Torment, where the thus-gone, worthy, perfect Buddha Campaka Color was residing, thriving, living well, and teaching the Dharma.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་དེའི་འཁོར་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་ཆོས་ཉན་པའི་ཕྱིར་འདུག་པར་གྱུར་ཏོ།
en: In that buddha realm, the bodhisattva great being named Quintessence of the Sun’s Energy was sitting in the assembly of the blessed thus-gone Campaka Color in order to listen to the Dharma.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོས་གྱེན་དུ་རྣམ་པར་བལྟས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོས་སྟེང་གི་ནམ་མཁའ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ཤར་ཕྱོགས་ནས་ཆས་ཤིང་ནུབ་ཕྱོགས་སུ་འདོང་བ་དག་མཐོང་བར་གྱུར་ཏོ།
en: At one point, as the bodhisattva great being Quintessence of the Sun’s Energy looked upward, he saw in the sky above that innumerable and countless bodhisattva great beings were departing from the east and proceeding toward the west.

source: །དེ་ནས་གང་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་འདོང་བ་ནུབ་ཕྱོགས་སུ་བལྟས་ནས་ཀྱང་།
en: When he looked toward the west where those bodhisattva great beings were going, he saw a brilliant light.

source: དེ་ནས་སྣང་བ་ཆེན་པོ་མཐོང་ནས་དེའི་ཚེ་སངས་རྒྱས་ཙམ་པ་ཀའི་མདོག་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་རབ་ཏུ་བཏུད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་སྟེང་གི་ནམ་མཁའ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མ་མཆིས། དཔག་ཏུ་མ་མཆིས་པ་ཤར་ཕྱོགས་ནས་ཆས་ཤིང་ནུབ་ཕྱོགས་སུ་མཆི་བ་དག་བདག་གིས་མཐོང་ལགས་སོ།
en: At that moment, he bowed down with his palms joined together in the direction of the Buddha Campaka Color and asked, “Respected Blessed One, I have seen in the sky above that innumerable and countless bodhisattva great beings are departing from the east and proceeding toward the west.

source: །ནུབ་ཕྱོགས་སུ་སྣང་བ་ཆེན་པོ་ཡང་བདག་གིས་མཐོང་ལགས་ན་འདི་ལ་རྒྱུ་གང་ལགས།
en: I have also seen a brilliant light in the western direction. Why is this so?”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ནུབ་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་ནས་སྙིགས་མ་ལྔ་དང་ལྡན་པར་གནས་པ་ན། སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ། དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ།
en: The thus-gone Campaka Color replied to the bodhisattva great being Quintessence of the Sun’s Energy, “Noble son, in the western direction, beyond countless buddha realms as numerous as the grains of sand in the Ganges, in a place ripe with the five degenerations, there is a buddha realm called Sahā, where the thus-gone, worthy, perfect Buddha Śākyamuni resides, thrives, and lives well.

source: ཆོས་ཀྱི་ཚུལ་དང་དཀོན་མཆོག་གསུམ་གྱི་གདུང་ཡུན་རིང་དུ་གནས་པར་མཛད་པའི་ཕྱིར་དང་། ཆོས་ཀྱིས་གནས་པ་ཉིད་རྒྱུན་མི་གཅད་པའི་ཕྱིར་འདུས་པ་ཆེན་པོ་ལ་ཐེག་པ་གསུམ་རྣམ་པར་གཏན་ལ་དབབ་པ་བསྟན་པའི་སྒོའི་ཆོས་ཀྱི་རྣམ་གྲངས་རབ་ཏུ་སྟོན་པར་མཛད་དོ།
en: To ensure that the Dharma way and the lineage of the Three Jewels endure for a long time and that those who abide by the Dharma remain without interruption, he delivers to a great assembly Dharma teachings that are the gateways to the ascertainment of the three vehicles.

source: །སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་བདུད་ཀྱི་ཡུལ་རྣམ་པར་གཞིག་པའི་ཕྱིར་དང་། སྟོབས་དང་མི་ལྡན་པར་མཛད་པའི་ཕྱིར་དང་། ཆོས་ཀྱི་རྒྱལ་མཚན་བསྒྲེང་བར་མཛད་པའི་ཕྱིར་དང་། ཆོས་ཀྱི་ཚུལ་ཡུན་རིང་དུ་གནས་པར་མཛད་པའི་ཕྱིར་འདུ་བ་མཛད་དེ།
en: He has gathered an assembly in that buddha realm of Sahā in order to destroy the domain of the māras, to cause them to lose their power, to raise the banner of the Dharma, and to ensure that the Dharma way endures for a long time.

source: དེར་ཡང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་རིན་པོ་ཆེའི་ཏོག་ཅེས་བྱ་བའི་གཟུངས་སྔགས་བཤད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ལོངས་སྤྱད་པར་མཛད་ནས་སླར་གཤེགས་སོ།
en: There, all the thus-gone ones have uttered the dhāraṇī mantra called jewel crest and then left after having engaged with that buddha realm.

source: །ཡང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱི་འདུས་པ་ཆེན་པོ་ཡང་དག་པར་འདུས་པར་མཛད་དེ།
en: The thus-gone Śākyamuni has gathered a great assembly of bodhisattva great beings and great hearers.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་ལྡན་པའི་སྤྱན་གསུམ་དང་། ཚངས་པའི་གནས་པ་དག་བསྟན་ཀྱང་ད་དུང་འཁོར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཀྱི་ས་དང་ནམ་མཁའ་མ་འདྲེས་པར་གང་བ་ཞིག་དེ་བཞིན་གཤེགས་པ་ཆོས་དམ་པ་གསུང་བ་ཤཱཀྱ་ཐུབ་པའི་ཆོས་བསྟན་པ་ལ་ངོམས་པ་མེད་དོ།
en: They possess the three eyes that are endowed with the four correct knowledges, and they display the sublime states. This retinue distinctly fills the earth and the sky of the buddha realm of Sahā, and it is insatiable with respect to the sacred Dharma teachings revealed by the thus-gone Śākyamuni.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་མཆོག་ཏུ་སྙན་པར་གསུང་བ་ཤཱཀྱ་ཐུབ་པ་བསྡུ་བའི་དངོས་པོ་བཞི་དང་། ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཉིད་དང་། བདུད་ཀྱི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་དང་། སེམས་ཅན་གྱི་ལས་ཟད་པར་འགྱུར་བའི་གཟུངས་སྔགས་བཤད་པར་བཞེད་ནས་དེ་འདི་སྙམ་དུ་དགོངས་ཏེ།
en: “At one point, the thus-gone Śākyamuni, who is endowed with the most delightful voice, wished to explain the four means of attracting disciples, the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the nāgas, the dhāraṇī mantra that exhausts the karmic actions of sentient beings. So he formed the following wish:

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་བསྐལ་པ་བརྒྱས་ངེས་པར་བྱུང་བ་ནས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པའི་ཕྱིར་མི་ལྡོག་པ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་ལ་མཁས་པའི་བར་འཁོད་པ་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་ཞུགས་པར་གྱུར་ཅིང་།
en: ‘May all bodhisattva great beings who are practicing the six perfections within all the buddha realms of the ten directions—those who have reached emancipation over a hundred eons, who possess the eighteen unique qualities, who are not led astray by others, who have reached the level of nonregression, and who are experts in unobstructed wisdom—come to this buddha realm of Sahā!

source: འདིར་འཁོད་ནས་རང་རང་གི་དགེ་བའི་ཕྱོགས་དང་བསམ་གཏན་དག་གིས་རྣམ་པར་སྤྱོད་པར་གྱུར་ལ། དེས་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་ས་ཆེན་པོ་ཤིན་ཏུ་སྐལ་བ་དང་ལྡན་པ་དང་། བཅུད་དང་ལྡན་པ་དང་། ཡོན་ཏན་དང་ལྡན་པ་དང་། དྲན་པ་དང་ལྡན་པ་དང་། བརྩོན་འགྲུས་དང་ལྡན་པ་དང་། གཏོང་བ་དང་ལྡན་པར་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་བཞིན་གྱུར་ཅིག་སྙམ་དགོངས་སོ།
en: Once they have assembled here, may they employ their individual virtuous qualities and concentrations so that in this buddha realm this great earth may become highly favorable and nourishing and so that beings may be endowed with qualities, recall, diligence, and generosity—just as in other buddha realms!’

source: །དེ་ལྟ་བས་ན་ད་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་སུ་དག་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་ཞུགས་པ་དེ་དག་དེར་འཁོད་ནས་རང་རང་གི་ཇི་ལྟར་འཚམ་པའི་དགེ་བའི་ཕྱོགས་ཀྱིས་བསམ་གཏན་དག་བྱེད་དེ། སྒོམ་པ་དེ་དག་ལས་ཁ་ཅིག་གིས་ལུས་ལས་ནི་འོད་འདི་ལྟ་བུ་བྱུང་སྟེ། དཔེར་ན་འབྲུ་མར་གྱི་མར་མེ་བཞིན་ནོ།
en: “This is why the bodhisattva great beings who have entered that buddha realm of Sahā are now sitting there absorbed in concentration in accordance with their own appropriate virtuous qualities, and this is why light is now radiating from the bodies of some of those meditators, as if from oil lamps.

source: །ཁ་ཅིག་གི་ལུས་ལས་ནི་འོད་འདི་ལྟ་བུའི་བར་དག་བྱུང་སྟེ། དཔེར་ན་ཟླ་བ་དང་ཉི་མ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་མང་པོའི་འོད་བཞིན་ནོ།
en: From the bodies of some of the others radiate light rays like the light emitted by many hundreds of thousands of suns and moons.

source: །དེར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མང་དུ་འདུས་པ་ད་ལྟར་སྣང་བ་ཆེན་པོས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཁྱབ་པར་གྱུར་ཏོ།
en: The brilliant light emitted by the gathering of those numerous bodhisattva great beings is now pervading the buddha realm of Sahā.

source: །ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ལྷགས་པར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་སྔོན་དེར་མ་ཕྱིན་པ་ཤ་སྟག་དེའི་ཚེ་ཏིང་ངེ་འཛིན་ལས་ལངས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་ཆས་ཏེ་དེར་དོང་ནས་ཀྱང་སྐྱིལ་མོ་ཀྲུང་གིས་འཁོད་ཅིང་རང་རང་གི་བསམ་གཏན་རྣམ་པ་སྣ་ཚོགས་དག་གིས་རྩེ་བར་བྱེད་དོ།
en: All those bodhisattva great beings who have arrived from all the buddha realms of the ten directions, none of whom had ever gone there before, arose from their absorptions and departed for the buddha realm of Sahā. Having arrived, they are now sitting cross-legged and revel in their individual concentrations.

source: །དེར་ཡང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་དེ་དག་ཕྱག་འཚལ་བར་བྱེད་དོ། །བསྙེན་བཀུར་བྱེད་དོ། འདུས་པ་ཆེན་པོ་དེ་ལ་ཡང་ལྟ་བར་བྱེད་དོ།
en: They pay homage to the thus-gone Śākyamuni and serve him, and they behold his great assembly.

source: །དེར་དེ་དག་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་དང་། ཀླུ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ལས་ཟད་པར་འགྱུར་བའི་གཟུངས་སྔགས་ཉན་པར་ཡང་བྱེད་དོ།
en: There, they also listen to the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the nāgas, the dhāraṇī mantra that exhausts the karmic actions of sentient beings.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱང་ད་ལྟར་ཏིང་ངེ་འཛིན་ལས་ལངས་པས་རིགས་ཀྱི་བུ་ཁྱོད་ད་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་བར་བྱའོ། །རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེ་ན་ནི་སེམས་ཅན་རྣམས་ཤིན་ཏུ་སྲེད་པའི་ཀུན་ཏུ་སྦྱོར་བ་དང་ལྡན་ཞིང་སྲིད་པའི་ལྟུང་ལ་བཏགས་པ་དག་ཡིན་ཏེ།
en: “Noble son, since you have arisen from your absorption, you should, noble son, go to the Sahā world! Noble son, in that buddha realm of Sahā, sentient beings are bound by intense craving—they are referred to as those who have fallen into craving.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ནང་ན་ཡང་བུད་མེད་གཟུགས་མི་སྡུག་པ་དང་། ཚུལ་དུ་མི་ཤིས་པ་དང་། མཆོག་ཏུ་གཟུགས་ཀྱི་རྒྱགས་པས་དྲེགས་པ་དང་། དྲི་ང་བ་དང་། མི་གཙང་བ་དང་། གཙང་སྦྲར་སྤྱོད་པའི་རྒྱགས་པས་དྲེགས་པ་དང་། ངོ་གཉིས་བྱེད་པ་དང་། བདེན་པ་མ་ཡིན་པའི་ཚིག་སྨྲ་བ་དང་། ཚངས་པར་སྤྱོད་པར་ང་རྒྱལ་བྱེད་པ་དང་། བླུན་པ་དང་། མཁས་པར་ང་རྒྱལ་ཅན་དང་།
en: In that buddha realm, women are unattractive and ugly, yet they are extremely conceited in terms of their appearance. They are smelly and unclean yet conceited due to their obsession with cleanliness. They are two-faced and lying yet proud of their pure conduct. They are stupid yet proud of their skills.

source: སེར་སྣ་ཅན་དང་། གཏོང་བར་ང་རྒྱལ་ཅན་དང་། མ་དད་པ་དང་། དད་པར་ང་རྒྱལ་ཅན་དང་། གཡོ་སྒྱུ་ཅན་དང་། སྒྱུ་བྱེད་པ་དང་། དྲང་པོའོ་སྙམ་པའི་ང་རྒྱལ་ཅན་དང་། ཕྲག་དོག་ཅན་དང་། ཕྲག་དོག་མེད་པའོ་སྙམ་པའི་ང་རྒྱལ་ཅན་དང་། གནོད་སེམས་དང་ལྡན་པའི་སེམས་དང་། བྱམས་པར་ང་རྒྱལ་ཅན་དང་།
en: They are miserly yet proudly consider themselves generous. They are unfaithful yet proudly consider themselves faithful. They are hypocritical and deceitful yet proudly consider themselves honest. They are envious yet proudly consider themselves free from envy. They are malicious yet proudly consider themselves loving.

source: རྣམ་པར་དབྱེན་བྱེད་པ་དང་། འཐུན་པར་ང་རྒྱལ་ཅན་དང་། ལོག་པར་ལྟ་བ་པ་དང་། ཡང་དག་པར་ལྟ་བའི་ང་རྒྱལ་ཅན་ཡིན་ཏེ། སྐྱེས་བུ་དམ་པ་མཁས་པ་ཆེན་པོ་རྫུ་འཕྲུལ་དང་ལྡན་པ་མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་བདག་བསམ་གཏན་ཡོངས་སུ་སྦྱོང་བ་བྱས་སུ་ཟིན་ཀྱང་ཡུད་ཙམ་གྱིས་བུད་མེད་ཀྱི་དབང་དུ་འགྱུར་བ་ཡིན་ནོ།
en: They create divisions yet proudly consider themselves harmonious. They have wrong views yet proudly consider their views to be correct. Even sacred beings who are great scholars, who possess magical powers, who revel in the higher perceptions, and who have trained in concentration can be overpowered by women in an instant.

source: །བུད་མེད་ཀྱི་ཉེས་པས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཉམས་པ་དག་དང་། ངན་སོང་བ་དག་དང་། སེམས་ཅན་དམྱལ་བ་པ་དག་ཏུ་འགྱུར་བ་ཡིན་ནོ།
en: Through the faults of women, all their roots of virtue will be destroyed, and they will go to the lower realms and be born as hell beings.

source: །རིགས་ཀྱི་བུ་ཁྱེད་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་ངའི་བཀས་ཞུ་བའི་ཕྱིར་ངའི་བཀས་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་བར་སྤྲོ་ན། དེར་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུའི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཟད་པར་འགྱུར་བའི་གཟུངས་སྔགས་ལ་ང་དད་པ་སྦྱིན་པར་མཛད་དོ།
en: “Noble son, if you would like to bring my words to the Sahā world in order to convey them to the thus-gone Śākyamuni, these words of mine will instill faith in the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the domain of the nāgas, the dhāraṇī mantra that exhausts the karmic actions of sentient beings.

source: །དེར་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་མཐུ་ཆེ་བ།
en: For that I shall confer the dhāraṇī mantra that accords with the truth.

source: ཕན་ཡོན་ཆེ་བ།
en: It is powerful and very beneficial.

source: འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། གཟུགས་མེད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། ང་རྒྱལ་དང་། ལྷག་པའི་ང་རྒྱལ་དང་། ངའོ་སྙམ་པའི་ང་རྒྱལ་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། ཚོལ་བ་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ།
en: It exhausts all forms of attachment associated with the desire realm, the form realm, and the formless realm as well as all forms of pride, special pride, and pride that thinks ‘I am.’ It exhausts all forms of longing, covetousness, excitement, and ignorance.

source: བརྣབ་སེམས་ཐམས་ཅད་དང་། རྒོད་པ་ཐམས་ཅད་དང་། མ་རིག་པ་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། འཇིག་ཚོགས་ལ་ལྟ་བ་ཐམས་ཅད་དང་། མཐར་འཛིན་པའི་ལྟ་བ་ཐམས་ཅད་དང་། ཐེ་ཙོམ་ཐམས་ཅད་དང་། ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་མཆོག་ཏུ་འཛིན་པ་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། རྟག་པར་ལྟ་བ་ཐམས་ཅད་དང་། ཆད་པར་ལྟ་བ་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། སེམས་ཅན་དུ་ལྟ་བ་ཐམས་ཅད་དང་། སྒྲིབ་པར་ལྟ་བ་ཐམས་ཅད་དང་། གསོ་བར་ལྟ་བ་ཐམས་ཅད་དང་། གང་ཟག་ཏུ་ལྟ་བ་ཐམས་ཅད་དང་། བྱེད་པ་པོར་ལྟ་བ་ཐམས་ཅད་དང་། ཚོར་བ་པོར་ལྟ་བ་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། གཟུགས་སུ་ལྟ་བ་ཐམས་ཅད་དང་། སྒྲར་ལྟ་བ་ཐམས་ཅད་དང་། དྲིར་ལྟ་བ་ཐམས་ཅད་དང་། རོར་ལྟ་བ་ཐམས་ཅད་དང་། རེག་བྱར་ལྟ་བ་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། རྨད་དུ་བྱུང་བ་ཆེན་པོར་ལྟ་བ་ཐམས་ཅད་དང་། སྐྱེ་བར་ལྟ་བ་ཐམས་ཅད་དང་། གནས་པར་ལྟ་བ་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ་འདི་དང་།
en: It exhausts the views related to the transitory collection, all the extremist views, all doubts, all the views that consider discipline and disciplined conduct to be supreme, and all the views of permanence and nihilism, as well as all the views related to sentient beings, obscurations, living beings, persons, creators, feeling subjects, forms, sounds, smells, tastes, textures, great marvels, birth, and abiding.

source: བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་གཟུགས་ཀྱི་ཕུང་པོ་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པར་བྱེད་པ་ནས།
en: This acceptance that accords with the truth induces complete and genuine understanding of all the aggregates, from the aggregate of form up to the aggregate of consciousness.

source: རྣམ་པར་ཤེས་པའི་ཕུང་པོ་ཐམས་ཅད་ཀྱི་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པར་བྱེད་པ། མིག་གི་དབང་པོ་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པར་བྱེད་པ་ནས།
en: It induces complete and genuine understanding of all the faculties, from the eye faculty up to the mind faculty.
